performance-tests.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Calentamiento"
    - duration: 120
      arrivalRate: 10
      rampTo: 20
      name: "Carga media"
    - duration: 180
      arrivalRate: 20
      rampTo: 30
      name: "Carga alta"

scenarios:
  - name: "Flujo de autenticación y gestión de pacientes"
    flow:
      # Login de usuario
      - post:
          url: "/auth/login"
          json:
            email: "test@example.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"

      # Búsqueda de pacientes
      - get:
          url: "/pacientes"
          headers:
            Authorization: "Bearer {{ authToken }}"

      # Registro de nuevo paciente
      - post:
          url: "/pacientes"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            dni: "12345678A"
            nombre: "Paciente Test"
            email: "paciente@test.com"
            telefono: "123456789"
            direccion: "Calle Test 123"
            fechaNacimiento: "1990-01-01"

  - name: "Flujo de gestión de pruebas médicas"
    flow:
      # Login
      - post:
          url: "/auth/login"
          json:
            email: "test@example.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"

      # Crear nueva prueba
      - post:
          url: "/pruebas"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            id_paciente: "test-id"
            tipo: "Análisis de sangre"
            fecha: "2024-01-20"
            hora: "10:00"

      # Obtener detalles de prueba
      - get:
          url: "/pruebas/{{ id_prueba }}"
          headers:
            Authorization: "Bearer {{ authToken }}"

      # Finalizar prueba
      - put:
          url: "/pruebas/{{ id_prueba }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            resultado: "Resultados normales"
            estado: "completada"

  - name: "Flujo de historial médico"
    flow:
      # Login
      - post:
          url: "/auth/login"
          json:
            email: "test@example.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"

      # Obtener historial de paciente
      - get:
          url: "/historial/{{ id_paciente }}"
          headers:
            Authorization: "Bearer {{ authToken }}"

      # Obtener detalles de citas
      - get:
          url: "/citas/paciente/{{ id_paciente }}"
          headers:
            Authorization: "Bearer {{ authToken }}"